Repository: YossiMorgen/almog-frontend
Catalog: src/locale/messages.*.xlf
Languages: he

# cancel.tooltip
source: Cancel
he: ביטול

# season.title
source: {{ seasonId ? 'Edit Season' : 'Create New Season' }}
he: {{ seasonId ? 'עריכת עונה' : 'יצירת עונה חדשה' }}

# season.loading
source: {{ seasonId ? 'Loading season...' : 'Creating season...' }}
he: {{ seasonId ? 'טוען עונה...' : 'יוצר עונה...' }}

# season.name.label
source: Season Name
he: שם העונה

# season.name.placeholder
source: e.g., Summer 2024
he: למשל, קיץ 2024

# season.name.required
source: Season name is required
he: שם העונה נדרש

# season.name.minlength
source: Season name must be at least 2 characters
he: שם העונה חייב להיות לפחות 2 תווים

# season.name.maxlength
source: Season name must be less than 100 characters
he: שם העונה חייב להיות פחות מ-100 תווים

# season.year.label
source: Year
he: שנה

# season.year.required
source: Year is required
he: השנה נדרשת

# season.year.min
source: Year must be 1900 or later
he: השנה חייבת להיות 1900 או מאוחר יותר

# season.year.max
source: Year must be 3000 or earlier
he: השנה חייבת להיות 3000 או מוקדם יותר

# season.startDate.label
source: Start Date
he: תאריך התחלה

# season.startDate.required
source: Start date is required
he: תאריך התחלה נדרש

# season.endDate.label
source: End Date
he: תאריך סיום

# season.endDate.required
source: End date is required
he: תאריך סיום נדרש

# season.registrationStartDate.label
source: Registration Start Date
he: תאריך התחלת הרשמה

# season.registrationEndDate.label
source: Registration End Date
he: תאריך סיום הרשמה

# season.activeCheckbox
source: Active Season
he: עונה פעילה

# common.cancel
source: Cancel
he: ביטול

# season.submit
source: {{ seasonId ? 'Update Season' : 'Create Season' }}
he: {{ seasonId ? 'עדכן עונה' : 'צור עונה' }}

# header.appTitle
source: Swimming School CRM
he: מערכת ניהול בית ספר לשחייה

# header.home
source: Home
he: בית

# header.dashboard
source: Dashboard
he: לוח בקרה

# header.academic
source: <mat-icon>school</mat-icon> Academic <mat-icon>arrow_drop_down</mat-icon>
he: <mat-icon>school</mat-icon> אקדמי <mat-icon>arrow_drop_down</mat-icon>

# header.seasons
source: Seasons
he: עונות

# header.students
source: Students
he: תלמידים

# header.courses
source: Courses
he: קורסים

# header.classes
source: Classes
he: שיעורים

# header.enrollments
source: Enrollments
he: הרשמות

# header.studentClasses
source: Student Classes
he: שיעורי תלמידים

# header.business
source: <mat-icon>business</mat-icon> Business <mat-icon>arrow_drop_down</mat-icon>
he: <mat-icon>business</mat-icon> עסקי <mat-icon>arrow_drop_down</mat-icon>

# header.products
source: Products
he: מוצרים

# header.orders
source: Orders
he: הזמנות

# header.orderItems
source: Order Items
he: פריטי הזמנה

# header.payments
source: Payments
he: תשלומים

# header.paymentInstallments
source: Payment Installments
he: תשלומים בתשלומים

# header.admin
source: <mat-icon>admin_panel_settings</mat-icon> Admin <mat-icon>arrow_drop_down</mat-icon>
he: <mat-icon>admin_panel_settings</mat-icon> מנהל <mat-icon>arrow_drop_down</mat-icon>

# header.users
source: Users
he: משתמשים

# header.roles
source: Roles
he: תפקידים

# header.permissions
source: Permissions
he: הרשאות

# header.toggleTheme
source: Toggle Theme
he: החלף ערכת נושא

# header.signOut
source: Sign Out
he: התנתק

# header.signIn
source: Sign In
he: התחבר

# header.profile
source: Profile
he: פרופיל

# profile.settings.tab
source: Settings
he: הגדרות

# profile.settings.language.title
source: Language Settings
he: הגדרות שפה

# profile.settings.language.label
source: Preferred Language
he: שפה מועדפת

# profile.settings.language.hint
source: Choose your preferred language for the interface
he: בחר את השפה המועדפת שלך לממשק

# profile.settings.language.updating
source: Updating...
he: מעדכן...

# profile.settings.language.update
source: Update Language
he: עדכן שפה

# home.welcome.title
source: Welcome to Swimming School CRM {{ currentUser?.name }}
he: ברוכים הבאים למערכת ניהול בית ספר לשחייה {{ currentUser?.name }}

# home.welcome.subtitle
source: Manage your swimming school efficiently with our comprehensive management system
he: נהל את בית הספר לשחייה שלך ביעילות עם מערכת הניהול המקיפה שלנו

# home.actions.dashboard.title
source: Dashboard
he: לוח בקרה

# home.actions.dashboard.description
source: View overview and analytics
he: צפה בסקירה וניתוחים

# home.actions.students.title
source: Students
he: תלמידים

# home.actions.students.description
source: Manage student records
he: נהל רשומות תלמידים

# home.actions.courses.title
source: Courses
he: קורסים

# home.actions.courses.description
source: Organize swimming courses
he: ארגן קורסי שחייה

# home.actions.orders.title
source: Orders
he: הזמנות

# home.actions.orders.description
source: Track orders and payments
he: עקוב אחר הזמנות ותשלומים

# home.stats.activeStudents.title
source: Active Students
he: תלמידים פעילים

# home.stats.activeStudents.label
source: Currently enrolled
he: רשומים כרגע

# home.stats.activeCourses.title
source: Active Courses
he: קורסים פעילים

# home.stats.activeCourses.label
source: Running this season
he: פועלים בעונה זו

# home.stats.pendingOrders.title
source: Pending Orders
he: הזמנות ממתינות

# home.stats.pendingOrders.label
source: Awaiting processing
he: ממתינות לעיבוד

# home.stats.revenue.title
source: Revenue
he: הכנסות

# home.stats.revenue.label
source: This month
he: החודש

# dashboard.title
source: CRM Dashboard
he: לוח בקרה CRM

# dashboard.subtitle
source: Manage your swimming school operations efficiently
he: נהל את פעולות בית הספר לשחייה ביעילות

# dashboard.refresh
source: Refresh
he: רענן

# dashboard.loading
source: Loading dashboard data...
he: טוען נתוני לוח בקרה...

# dashboard.error.title
source: Unable to Load Dashboard
he: לא ניתן לטעון את לוח הבקרה

# dashboard.error.tryAgain
source: Try Again
he: נסה שוב

# dashboard.overview.title
source: Overview
he: סקירה כללית

# dashboard.stats.totalStudents
source: Total Students
he: סה"כ תלמידים

# dashboard.stats.studentsChange
source: +12% this month
he: +12% החודש

# dashboard.stats.activeCourses
source: Active Courses
he: קורסים פעילים

# dashboard.stats.coursesChange
source: No change
he: ללא שינוי

# dashboard.stats.classesThisWeek
source: Classes This Week
he: שיעורים השבוע

# dashboard.stats.classesChange
source: +3 new
he: +3 חדשים

# dashboard.stats.monthlyRevenue
source: Monthly Revenue
he: הכנסות חודשיות

# dashboard.stats.revenueChange
source: +8% from last month
he: +8% מהחודש שעבר

# dashboard.quickActions.title
source: Quick Actions
he: פעולות מהירות

# dashboard.actions.addStudent
source: Add Student
he: הוסף תלמיד

# dashboard.actions.addStudentDesc
source: Register a new student
he: הרשם תלמיד חדש

# dashboard.actions.createCourse
source: Create Course
he: צור קורס

# dashboard.actions.createCourseDesc
source: Set up a new swimming course
he: הגדר קורס שחייה חדש

# dashboard.actions.scheduleClass
source: Schedule Class
he: תזמן שיעור

# dashboard.actions.scheduleClassDesc
source: Add a new class session
he: הוסף מפגש שיעור חדש

# dashboard.actions.manageSeasons
source: Manage Seasons
he: נהל עונות

# dashboard.actions.manageSeasonsDesc
source: View and manage seasons
he: צפה ונהל עונות

# dashboard.actions.viewAll
source: View All
he: צפה בהכל

# dashboard.actions.viewAllDesc
source: Browse all students
he: עיין בכל התלמידים

# unauthorized.title
source: Access Denied
he: גישה נדחתה

# unauthorized.message
source: You don't have the required permissions to access this page. Please contact your administrator if you believe this is an error.
he: אין לך את ההרשאות הנדרשות לגשת לדף זה. אנא פנה למנהל המערכת אם אתה מאמין שזו שגיאה.

# unauthorized.goToDashboard
source: Go to Dashboard
he: עבור ללוח הבקרה

# profile.personalInfo.fullNamePlaceholder
source: Enter your full name
he: הזן את שמך המלא

# profile.personalInfo.emailPlaceholder
source: Enter your email
he: הזן את האימייל שלך

# profile.personalInfo.title
source: Personal Information
he: מידע אישי

# profile.personalInfo.fullName
source: Full Name
he: שם מלא

# profile.personalInfo.email
source: Email
he: אימייל

# profile.personalInfo.emailHint
source: Email cannot be changed here. Use the Security tab to update email.
he: לא ניתן לשנות אימייל כאן. השתמש בלשונית האבטחה לעדכון האימייל.

# profile.personalInfo.nameRequired
source: Name is required
he: השם נדרש

# profile.personalInfo.nameMaxLength
source: Name must be less than 200 characters
he: השם חייב להיות פחות מ-200 תווים

# profile.personalInfo.updating
source: Updating...
he: מעדכן...

# profile.personalInfo.updateProfile
source: Update Profile
he: עדכן פרופיל

# profile.rolesPermissions.title
source: Roles & Permissions
he: תפקידים והרשאות

# profile.rolesPermissions.roles
source: Roles
he: תפקידים

# profile.rolesPermissions.permissions
source: Permissions
he: הרשאות

# profile.security.emailVerification.title
source: Email Verification
he: אימות אימייל

# profile.security.googleSecurity.title
source: Google Account Security
he: אבטחת חשבון Google

# profile.security.googleSecurity.subtitle
source: Google Account Security
he: אבטחת חשבון Google

# profile.security.googleSecurity.description
source: Your account is secured through Google OAuth. To change your password or manage security settings, please visit your Google Account settings.
he: החשבון שלך מאובטח באמצעות Google OAuth. כדי לשנות את הסיסמה שלך או לנהל הגדרות אבטחה, אנא בקר בהגדרות חשבון Google שלך.

# profile.security.googleSecurity.manageButton
source: Manage Google Security
he: נהל אבטחת Google

# profile.security.emailVerification.verified
source: Email is verified
he: האימייל מאומת

# profile.security.emailVerification.unverified
source: Email is not verified
he: האימייל לא מאומת

# profile.security.emailVerification.message
source: Please verify your email address to secure your account and access all features.
he: אנא אמת את כתובת האימייל שלך כדי לאבטח את החשבון שלך ולגשת לכל התכונות.

# profile.security.emailVerification.emailVerified
source: Email Verified
he: אימייל מאומת

# profile.security.emailVerification.sendVerification
source: Send Verification Email
he: שלח אימייל אימות

# profile.apiKeys.createNew.keyNamePlaceholder
source: e.g., Mobile App v1.0
he: למשל, אפליקציה ניידת v1.0

# profile.apiKeys.createNew.title
source: Create New API Key
he: צור מפתח API חדש

# profile.apiKeys.createNew.keyName
source: Key Name
he: שם המפתח

# profile.apiKeys.list.title
source: Your API Keys
he: מפתחות ה-API שלך

# profile.apiKeys.usage.title
source: How to Use API Keys
he: איך להשתמש במפתחות API

# profile.apiKeys.usage.authentication
source: Authentication
he: אימות

# profile.apiKeys.usage.authenticationDescription
source: Include your API key in the <code>X-API-Key</code> header when making requests:
he: הכלל את מפתח ה-API שלך בכותרת <code>X-API-Key</code> בעת ביצוע בקשות:

# profile.apiKeys.usage.permissions
source: Permissions
he: הרשאות

# profile.apiKeys.usage.permissionsDescription
source: API keys have the same permissions as your user account. If your permissions change, the API key will automatically reflect the new permissions.
he: למפתחות API יש את אותן הרשאות כמו לחשבון המשתמש שלך. אם ההרשאות שלך משתנות, מפתח ה-API ישקף אוטומטית את ההרשאות החדשות.

# profile.apiKeys.usage.security
source: Security
he: אבטחה

# profile.apiKeys.usage.security1
source: Store API keys securely and never share them
he: אחסן מפתחות API בצורה מאובטחת ולעולם אל תשתף אותם

# profile.apiKeys.usage.security2
source: Regenerate keys regularly for long-term integrations
he: צור מחדש מפתחות באופן קבוע לאינטגרציות ארוכות טווח

# profile.apiKeys.usage.security3
source: Deactivate unused keys instead of deleting them
he: השבת מפתחות לא בשימוש במקום למחוק אותם

# profile.apiKeys.usage.security4
source: Use HTTPS for all API communications
he: השתמש ב-HTTPS לכל התקשורת עם ה-API

# profile.apiKeys.usage.security5
source: API keys are for external applications only - not for this web interface
he: מפתחות API מיועדים ליישומים חיצוניים בלבד - לא לממשק האינטרנט הזה

# profile.apiKeys.createNew.nameRequired
source: Key name is required
he: שם המפתח נדרש

# profile.apiKeys.createNew.nameMaxLength
source: Key name must be less than 100 characters
he: שם המפתח חייב להיות פחות מ-100 תווים

# profile.apiKeys.createNew.creating
source: Creating...
he: יוצר...

# profile.apiKeys.createNew.create
source: Create API Key
he: צור מפתח API

# profile.apiKeys.list.loading
source: Loading API keys...
he: טוען מפתחות API...

# profile.apiKeys.list.empty.title
source: No API Keys
he: אין מפתחות API

# profile.apiKeys.list.empty.description
source: You haven't created any API keys yet. Create one above to get started.
he: עדיין לא יצרת מפתחות API. צור אחד למעלה כדי להתחיל.

# profile.apiKeys.details.name
source: Name:
he: שם:

# profile.apiKeys.details.prefix
source: Prefix:
he: קידומת:

# profile.apiKeys.details.created
source: Created:
he: נוצר:

# profile.apiKeys.details.updated
source: Updated:
he: עודכן:

# profile.accountManagement.title
source: Account Information
he: מידע חשבון

# profile.accountManagement.displayName
source: Display Name
he: שם תצוגה

# profile.accountManagement.emailAddress
source: Email Address
he: כתובת אימייל

# profile.accountManagement.accountCreated
source: Account Created
he: חשבון נוצר

# profile.accountManagement.lastSignIn
source: Last Sign In
he: התחברות אחרונה

# profile.accountManagement.emailStatus
source: Email Status
he: סטטוס אימייל

# profile.accountManagement.dangerZone.title
source: Danger Zone
he: אזור סכנה

# profile.accountManagement.dangerZone.deleteAccount.title
source: Delete Account
he: מחק חשבון

# profile.accountManagement.dangerZone.deleteAccount.description
source: Permanently delete your account and all associated data. This action cannot be undone.
he: מחק לצמיתות את החשבון שלך וכל הנתונים הקשורים. פעולה זו לא ניתנת לביטול.

# profile.accountManagement.verified
source: Verified
he: מאומת

# profile.accountManagement.unverified
source: Unverified
he: לא מאומת

# profile.accountManagement.dangerZone.deleteAccount.deleting
source: Deleting...
he: מוחק...

# profile.accountManagement.dangerZone.deleteAccount.delete
source: Delete Account
he: מחק חשבון

# profile.stats.roles
source: {{ userRoles.length !== 1 ? 'Roles' : 'Role' }}
he: {{ userRoles.length !== 1 ? 'תפקידים' : 'תפקיד' }}

# profile.stats.permissions
source: {{ userPermissions.length !== 1 ? 'Permissions' : 'Permission' }}
he: {{ userPermissions.length !== 1 ? 'הרשאות' : 'הרשאה' }}

# profile.stats.memberSince
source: Member since: {{ getAccountCreationDate() }}
he: חבר מאז: {{ getAccountCreationDate() }}

# profile.stats.lastSignIn
source: Last sign in: {{ getLastSignInDate() }}
he: התחברות אחרונה: {{ getLastSignInDate() }}

# profile.stats.verified
source: Verified
he: מאומת

# profile.stats.unverified
source: Unverified
he: לא מאומת

# profile.tabs.profileInfo
source: Profile Information
he: מידע פרופיל

# profile.tabs.security
source: Security
he: אבטחה

# profile.tabs.apiKeys
source: API Keys
he: מפתחות API

# profile.tabs.accountManagement
source: Account Management
he: ניהול חשבון

# profile.loading
source: Loading profile...
he: טוען פרופיל...
